Ћабораторна€ работа. –азвертывание коммутируемой сети с†резервными каналами
	“опологи€
 
	“аблица адресации
”стройство	»нтерфейс	IP-адрес	ћаска подсети
S1	VLAN 1	192.168.1.1	255.255.255.0
S2	VLAN 1	192.168.1.2	255.255.255.0
S3	VLAN 1	192.168.1.3	255.255.255.0
	÷ели
„асть 1. —оздание сети и†настройка основных параметров устройства
„асть 2. ¬ыбор корневого моста
„асть 3. Ќаблюдение за процессом выбора протоколом STP порта, исход€ из стоимости портов
„асть 4. Ќаблюдение за процессом выбора протоколом STP порта, исход€ из приоритета портов

—оздание сети  согласно  топологии
Ќастройка на коммутаторах IP адресов согласно таблице адресации
S1: ena Ц conf t Ц int vla 1 Ц ip add 192.168.1.1 255.255.255.0 Ц no shut
S2: ena Ц conf t Ц int vla 1 Ц ip add 192.168.1.2 255.255.255.0 Ц no shut
S3: ena Ц conf t Ц int vla 1 Ц ip add 192.168.1.3 255.255.255.0 Ц no shut
Ѕазова€ настройка:
ќтключите поиск DNS  
 S1(config)#no ip domain-lookup
Ќазначьте class в†качестве зашифрованного парол€ доступа к†привилегированному режиму
S1(config)#enable secret class
Ќазначьте cisco в†качестве паролей консоли:
S1(config)#line con 0 Ц password cisco Ц login - logging synchronous  - exit  
Ќастройка баннерного сообщени€ дл€ Motd
S1(config)#Banner motd  УThis is a secure system. Authorized Access Only!Ф
ѕроверимт св€зь
S1 ЦS2 , S2 ЦS3, S1 Ц S3 : ¬о всех случа€х успех

Sending 5, 100-byte ICMP Echos to 192.168.1.х, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 0/2/6 ms

ќтключаем порты и настраиваем Trunk ,смотрим состо€ние STP
 
 
 
